#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/gem-engineering/kubernetes-ops-stage-70-gem-frontend/runs/run-LssZst8PfkqWu1xb

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "standard-application"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gem-frontend"
      + namespace                  = "app-stage"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm-charts.managedkube.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                replicaCount: 1
                
                fullnameOverride: gem-frontend
                namespace: app-stage
                
                # containerSpecOptions:
                #   securityContext:
                #     runAsUser: 1000
                #     runAsGroup: 1000
                
                deployment:
                  containers:
                  - name: gem-frontend
                    image:
                      repository: 283278994941.dkr.ecr.us-east-1.amazonaws.com/frontend
                      tag: latest
                      pullPolicy: Always
                
                    ports:
                    - name: http
                      protocol: TCP
                      containerPort: 80
                      servicePort: 80
                
                    resources:
                      requests:
                        memory: 1Gi
                
                ingress:
                  enabled: true
                  annotations:
                    kubernetes.io/ingress.class: nginx-external
                    # kubernetes.io/tls-acme: "true"
                  paths:
                    - path: /
                      servicePort: http
                  hosts:
                    - www.stage.yourgem.app
                  tls: []
                  #  - secretName: chart-example-tls
                  #    hosts:
                  #      - chart-example.local
            EOT,
        ]
      + verify                     = false
      + version                    = "1.0.11"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>
*Pusher: @piratekev, Action: `pull_request`*